Feat: Updated README.md ----- PRE-FINAL DOCSSSSSSSSSSS
